---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.MEPAnalyticalSystem.GetWaterLoopData
source: html/ef47f29c-aec1-03d7-385b-5c238302e8fd.htm
---
# Autodesk.Revit.DB.Mechanical.MEPAnalyticalSystem.GetWaterLoopData Method

Returns the water loop data, null if not available.

## Syntax (C#)
```csharp
public WaterLoopData GetWaterLoopData()
```